import React, { useEffect, useState } from "react";
import styles from "./styles.module.scss";
import MusicPlayer from "./musicPlayer";
import { getAllPodcasts } from "../../api/podcast";

const Podcast = () => {

    const [podcast , setPodcast] = useState(null);



    useEffect(() => {
        const fetchData = async () => {
          try {
            const data = await getAllPodcasts();
            setPodcast(data?.data);
          } catch (error) {
            console.error("Error fetching data:", error);
          }
        };
    
        fetchData();
    }, []);


    

    return(
        <div className={styles.podcastwrapper}>
            <div className={styles.podcast}>
                <div className={styles.podcast__vector}>
                    <svg xmlns="http://www.w3.org/2000/svg" width="55" height="55" viewBox="0 0 55 55" fill="none">
                        <path d="M43.8176 20.8999C42.9238 20.8999 42.2134 21.6103 42.2134 22.504V26.1249C42.2134 34.2374 35.6134 40.8374 27.5009 40.8374C19.3884 40.8374 12.7884 34.2374 12.7884 26.1249V22.4811C12.7884 21.5874 12.078 20.877 11.1842 20.877C10.2905 20.877 9.58008 21.5874 9.58008 22.4811V26.102C9.58008 35.429 16.753 43.1061 25.8967 43.9311V48.8124C25.8967 49.7061 26.6072 50.4165 27.5009 50.4165C28.3947 50.4165 29.1051 49.7061 29.1051 48.8124V43.9311C38.2259 43.129 45.4217 35.429 45.4217 26.102V22.4811C45.3988 21.6103 44.6884 20.8999 43.8176 20.8999Z" fill="#292D32"/>
                        <path d="M27.5003 4.58301C21.9086 4.58301 17.3711 9.12051 17.3711 14.7122V26.4455C17.3711 32.0372 21.9086 36.5747 27.5003 36.5747C33.0919 36.5747 37.6294 32.0372 37.6294 26.4455V14.7122C37.6294 9.12051 33.0919 4.58301 27.5003 4.58301ZM30.5023 20.5101C30.3419 21.1059 29.8148 21.4955 29.219 21.4955C29.1044 21.4955 28.9898 21.4726 28.8753 21.4497C27.9815 21.1976 27.0419 21.1976 26.1482 21.4497C25.4148 21.6559 24.7044 21.2205 24.5211 20.5101C24.3148 19.7997 24.7503 19.0663 25.4607 18.883C26.8128 18.5163 28.2336 18.5163 29.5857 18.883C30.2732 19.0663 30.6857 19.7997 30.5023 20.5101ZM31.7169 16.0643C31.5107 16.6143 31.0065 16.9351 30.4565 16.9351C30.2961 16.9351 30.1586 16.9122 29.9982 16.8663C28.394 16.2705 26.6065 16.2705 25.0023 16.8663C24.3148 17.1184 23.5357 16.7518 23.2836 16.0643C23.0315 15.3768 23.3982 14.5976 24.0857 14.3684C26.2857 13.5663 28.7148 13.5663 30.9148 14.3684C31.6023 14.6205 31.969 15.3768 31.7169 16.0643Z" fill="#292D32"/>
                    </svg>
                </div>
                <div className={styles.podcast__header}>
                    <p className={styles.title}>
                        دیارکست 
                    </p>
                    <p className={styles.desc}>
                        ما در کنار شما هستیم تا با شنیدن تجربیات و راهنمایی ها در موضوعات مختلف با ذهنی باز و شفاف پا به دنیای عجیب و غریب مهاجرت گذاریم , من محمد پیله چی همراه شما هستم .
                    </p>
                </div>
                <div className={styles.podcast__list}>
                    {podcast?.map((item) => (
                        <MusicPlayer data={item} />
                    ))}
                </div>
            </div>
        </div>
    )
}

export default Podcast;