import React from "react";
import styles from "./styles.module.scss";

const ProgramItem = () => {
    return(
        <div className={styles.programitem}>
            <div className={styles.title}>
                <svg xmlns="http://www.w3.org/2000/svg" width="1315" height="133" viewBox="0 0 1315 133" fill="none">
                    <path d="M0.5 61.2571C0.5 56.2943 4.32004 52.1677 9.26812 51.7853L665.757 1.05887C666.251 1.0207 666.747 1.02123 667.241 1.06045L1305.75 51.7672C1310.69 52.1594 1314.5 56.2823 1314.5 61.2373V123C1314.5 128.247 1310.25 132.5 1305 132.5H9.99997C4.75327 132.5 0.5 128.247 0.5 123V61.2571Z" fill="#F37123" stroke="#F37123"/>
                </svg>
                <p>
                    انواع ویزای تحصیلی کانادا کدام است؟
                </p>
            </div>
            <div className={styles.desc}>
                <p>
                    ویزای تحصیلی کانادا در دو دسته ویزای دانشجویی و ویزای دانش آموزی قرار می‌گیرد:
                    ویزای دانشجویی: این نوع ویزا برای متقاضیان بالای ۱۸ سال که قصد تحصیل در کالج‌ها و دانشگاه‌های کانادا را دارند، صادر می‌شود.
                    ویزای دانش آموزی: این نوع ویزا برای متقاضیان زیر ۱۸ سال که قصد تحصیل در مدارس کانادا را دارند، صادر می‌شود.
                </p>
            </div>
        </div>
    )
}

export default ProgramItem;